using System;

namespace D_Variables
{
    /// <summary>
    /// Пользователь вводит 3 числа (A, B и С). Выведите в консоль решение(значение X)
    /// линейного уравнения стандартного вида, где A*X+B=C.
    /// </summary>
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
